import React from 'react';
import { LessonType } from '../defs.js';
import { InfoScreen } from '../ui.js';

export function IntroText() {
  return (
    <div className = "IntroText">
      <p>
      לפניכם שיעור של 35 דקות. 
      </p>
      <p>
      לא ניתן לצאת במהלכו, אך אם מתעייפים ניתן לקחת הפסקה של דקה.
      העבודה על הניסוי מחייבת חיבור אינטרנטי. עבודה ללא חיבור אינטרנטי תיפסל מהניסוי.
      ללא חיבור אינטרנט רציף ומהירות אינטרנט סבירה, לא ניתן יהיה להשלים את הניסוי.
      כמו כן, אנא הצטיידו באוזניות, לאחר שווידאתם עם הנסיינית (יעל) שהן איכותיות מספיק.
      </p>
      <p>
      עליכם להפעיל את התוכנה פעם אחת בכל יום במשך חמישה ימים. לא תוכלו להפעילה יותר מפעם אחת ביום, אך עליכם לדאוג להפעילה בכל יום, ולסיים בכל הפעלה את ההדגמות והתרגילים (נתוני ההפעלה וההשתתפות יישלחו לנסיינית. התשלום על הניסוי מותנה בהקפדה על התנאים).
      </p>
      <p>
      את התוכנה יש להפעיל בכל חמשת הפעמים באמצעות אותה חומרה - אותו מחשב, אותו מסך, ואותו עכבר מחשב. במסגרת המבחן ביום השישי תתבקשו לפרט באיזו חומרה השתמשתם, אז אנא הקפידו על כך.
      התחלת התוכנה מותנית בתיאום מבחן ליום השישי. את המבחן יש לתאם מול הנסיינית, והוא יתבצע באמצעות אותו מחשב, מסך, עכבר, ואוזניות בהם תשתמשו במסגרת התרגולים.
      </p>
      <p>
      אם ברצונכם להפעיל את התוכנה כעת, הכניסו את מספר תעודת הזהות שלכם ולחצו על המשך.
      </p>
    </div>);
}

export function InfoText({lesson_type}) {
  switch (lesson_type) {
  case LessonType.MUSICAL_PIECES:
    return (
      <div>
        <p>בניסוי זה תלמדו לזהות אקורדים (מספר צלילים המנוגנים יחד) משמיעה באמצעות קישור לקטעים מוזיקליים.</p>
        <p>לתוכנה שני חלקים – חלק השיעור וחלק התרגול. בחלק התרגול עליכם להקיש על האקורד המזוהה באמצעות עכבר המחשב.</p>
        <p>אנא חברו אוזניות וסדרו עוצמה נוחה להאזנה. את עוצמת השמע אין לשנות תוך כדי הפעלת התוכנה.</p>
        <p>אנא קראו את הכיתוב המופיע על המסך לאורך כל השיעור.</p>
        <p>לכל שאלה או בעיה, אנא שלחו הודעה כתובה למייל <a href="mailto:yaeljm@gmail.com">yaeljm@gmail.com</a> או למספר הטלפון 0528931467, ותקבלו מענה בזריזות האפשרית.</p>
        <p>בהצלחה!</p>
      </div>
    );

  case LessonType.TONAL_CONTEXT:
    return (
      <div>
        <p>בניסוי זה תלמדו לזהות אקורדים (מספר צלילים המנוגנים יחד) משמיעה באמצעות הקשר טונאלי: תחושת המתח או הפתרון הנובעת משמיעת אקורד בתוך משפט מוזיקלי.</p>
        <p>לתוכנה שני חלקים – חלק השיעור וחלק התרגול. בחלק התרגול עליכם להקיש על האקורד המזוהה באמצעות עכבר המחשב.</p>
        <p>אנא חברו אוזניות וסדרו עוצמה נוחה להאזנה. את עוצמת השמע אין לשנות תוך כדי הפעלת התוכנה.</p>        
        <p>אנא קראו את הכיתוב המופיע על המסך לאורך כל השיעור.</p>
        <p>לכל שאלה או בעיה, אנא שלחו הודעה כתובה למייל <a href="mailto:yaeljm@gmail.com">yaeljm@gmail.com</a> או למספר הטלפון 0528931467, ותקבלו מענה בזריזות האפשרית.</p>
        <p>בהצלחה!</p>
      </div>
    );

  case LessonType.AUTOMATIC:
    return (
      <div>
        <p>בניסוי זה תלמדו לזהות אקורדים (מספר צלילים המנוגנים יחד) משמיעה באמצעות היכרות עם אופי האקורד - שינון של סאונד. אם תרצו (לא חובה) באפשרותכם למצוא אסוציאציות לזיהוי האקורדים השונים. אסוציאציה יכולה להיות כל דבר שהאקורד מזכיר לכם או מעורר בכם: צבע או גוון, בהיר או כהה, כלי נגינה, תקופה, רגש (שמח, עצוב, וכו'). השתמשו באסוציאציות רק אם הן ברורות לכם/ן.</p>
        <p>לתוכנה שני חלקים – חלק השיעור וחלק התרגול. בחלק התרגול עליכם להקיש על האקורד המזוהה באמצעות עכבר המחשב.</p>
        <p>אנא חברו אוזניות וסדרו עוצמה נוחה להאזנה. את עוצמת השמע אין לשנות תוך כדי הפעלת התוכנה.</p>
        <p>אנא קראו את הכיתוב המופיע על המסך לאורך כל השיעור.</p>
        <p>לכל שאלה או בעיה, אנא שלחו הודעה כתובה למייל <a href="mailto:yaeljm@gmail.com">yaeljm@gmail.com</a> או למספר הטלפון 0528931467, ותקבלו מענה בזריזות האפשרית.</p>
        <p>בהצלחה!</p>
      </div>
    );
  }
}

export const PretestInfo = () => {
  return (
    <div>
      <p>מיד יעלו על המסך 4 מלבנים. בכל פעם יסומן מלבן אחר על ידי עיגול שחור במרכזו.</p>
      <p>עליכם ללחוץ במהירות האפשרית על המלבן המסומן עם עיגול.</p>
      <p>חלק זה בודק את מהירות התגובה שלכם.</p>
    </div>
  );
};

export const TrainingInfo = props => {
  let { lesson_type, is_free, next } = props;
  let info;
  switch (lesson_type) {
  case LessonType.MUSICAL_PIECES:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו את השירים אותם שמעתם בחלקים הקודמים, ותצטרכו לזהות את האקורד הראשון שלהם.
            בדומה לחלק הקודם, האקורד יושמע גם אחרי הקטע המוזיקלי.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול. 
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו את השירים אותם שמעתם בחלקים הקודמים ותצטרכו לזהות את האקורד הראשון שלהם.
            האקורד יושמע גם אחרי הקטע המוזיקלי.
          </p>
          <p>
            ההבדל העיקרי הוא שבחלקים הבאים לא תוכלו לשמוע את האקורד יותר מפעם אחת,
            ועליכם לזהות את סוג האקורד במהירות האפשרית, וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, 
            גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  case LessonType.TONAL_CONTEXT:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו צמד אקורדים לאחר סולם עולה ויורד, ותצטרכו לזהות את האקורד הראשון בכל צמד.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול.
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו,
            גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו את הסולם העולה והיורד ואחריו צמד אקורדים, ותצטרכו לזהות את האקורד הראשון ביניהם.
          </p>
          <p>
            ההבדל העיקרי הוא שבחלקים הבאים לא תוכלו לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג
            האקורד במהירות האפשרית, וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג
            האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>

      );
    }
    break;
  case LessonType.AUTOMATIC:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            אם תרצו (לא חובה) באפשרותכם למצוא אסוציאציות לזיהוי האקורדים השונים. אסוציאציה יכולה להיות כל דבר שהאקורד
            מזכיר לכם או מעורר בכם: צבע או גוון, בהיר או כהה, כלי נגינה, תקופה, רגש (שמח, עצוב, וכו'). 
            השתמשו באסוציאציות רק אם הן ברורות לכם/ן.           
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את האקורד שוב, על ידי לחיצה על סמן הרמקול. לאחר זיהוי האוקרד, לחצו על סוג האקורד
            באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו,
            גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            ההבדל העיקרי הוא שבחלקים הבאים לא תוכלו לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות
            האפשרית, וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  }
  return <InfoScreen next={next} info={info}/>;
};

export const InfoBeforeTrainingPartB = props => {
  let { lesson_type, is_free, next } = props;
  let info;
  switch (lesson_type) {
  case LessonType.MUSICAL_PIECES:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו קטעים זהים, אך הפעם בביצוע של חליל ופסנתר, ותצטרכו לזהות את האקורד המושמע בליווי.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול. 
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו קטעים זהים, אך הפעם בביצוע של חליל ופסנתר, ותצטרכו לזהות את האקורד המושמע בליווי.
          </p>
          <p>
            לא ניתן לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות האפשרית, וללחוץ עליו
            באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  case LessonType.TONAL_CONTEXT:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו סולם עולה ויורד ואחריו אקורד בודד, ותצטרכו לזהות את האקורד.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול.
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו סולם עולה ויורד ואחריו אקורד בודד, ותצטרכו לזהות את האקורד.
          </p>
          <p>
            לא ניתן לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות האפשרית,
            וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  case LessonType.AUTOMATIC:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את האקורד שוב, על ידי לחיצה על סמן הרמקול. לאחר זיהוי האקורד, לחצו על סוג האקורד
            באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            לא ניתן לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות האפשרית,
            וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  }
  return <InfoScreen info={info} next={next}/>;
};

export const InfoBeforeTrainingPartC = props => {
  let { lesson_type, is_free, next } = props;
  let info;
  switch (lesson_type) {
  case LessonType.MUSICAL_PIECES:
    if (is_free) {
      info = (
        <div>
          <p>בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
            עליכם לשיר או לזמזם את השיר על האקורד, בכדי לנסות לזהות את סוג האקורד המתאים לשיר.</p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול. 
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
            עליכם לשיר או לזמזם את השיר על האקורד, בכדי לנסות לזהות את סוג האקורד המתאים לשיר.
          </p>
        </div>
      );
    }
    break;
  case LessonType.TONAL_CONTEXT:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול.
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            לא ניתן לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות האפשרית,
            וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  case LessonType.AUTOMATIC:
    if (is_free) {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים, ללא הקטע המוזיקלי, ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            בחלק זה באפשרותכם לשמוע את הקטע המוזיקלי שוב, על ידי לחיצה על סמן הרמקול.
            לאחר זיהוי האקורד, לחצו על סוג האקורד באמצעות העכבר.
          </p>
          <p>
            שימו לב: רצוי ללחוץ על סוג האקורד ברגע הראשון בו זיהיתם אותו, אבל הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם. אנא כוונו את העכבר למרכז המסך (סמן הרמקול) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    else {
      info = (
        <div>
          <p>
            בחלק זה תשמעו אקורדים בודדים ותצטרכו לזהות אותם במהירות האפשרית, וללחוץ על סוג האקורד.
          </p>
          <p>
            לא ניתן לשמוע את האקורד יותר מפעם אחת, ועליכם לזהות את סוג האקורד במהירות האפשרית,
            וללחוץ עליו באמצעות העכבר. הקטע יושמע עד סופו, גם אם תלחצו על סוג האקורד מוקדם.
            אנא כוונו את העכבר למרכז המסך (סימן הפלוס) לפני כל תרגיל.
          </p>
        </div>
      );
    }
    break;
  }
  return <InfoScreen info={info} next={next}/>;
};
